package org.example.AppTools;

public class Text {

    private final String[] appText = {
            "Сьогодні", "я", "прокинувся", "рано", "вранці,", "щоб", "насолодитися", "красивим", "сонячним", "світанком.",
            "Я", "вирішив", "піти", "на", "прогулянку", "парком,", "де", "зелена", "трава", "та",
            "квітучі", "дерева", "радували", "око.", "Я", "дихав", "свіжим", "повітрям", "і", "відчував,",
            "як", "кожен", "вдих", "наповнює", "мене", "енергією.", "Коли", "я", "дійшов", "до", "озера,",
            "я", "побачив,", "як", "вода", "м'яко", "хвилюється,", "а", "птахи", "весело", "співають.",
            "Я", "сів", "на", "лавку,", "щоб", "відпочити", "та", "поміркувати", "про", "свої", "мрії",
            "і", "плани", "на", "майбутнє.", "Це", "було", "приємне", "заняття,", "яке", "надихнуло",
            "мене", "на", "нові", "звершення.", "Я", "повернувся", "додому", "з", "усмішкою", "на",
            "обличчі", "та", "з", "бажанням", "поділитися", "цим", "чудовим", "досвідом."
    };

    public String[] getAppText() {
        return appText;
    }

    public void printText() {
        for (int i = 0; i < appText.length; i++) {
            System.out.printf(" " + appText[i]);
            if (i % 20 == 0) {
                System.out.println();
            }
        }
    }


}
